# Big Data Ph1
### Group 1

Refal Alammari - 
Leen Alharbi -
Ruba abdulkhaleq

### 1 - Dataset:

Salaries of jobs in the Data Science domain

#### 1.1 - Data size:

In [5]:
import pandas as pd
df = pd.read_csv('ds_salaries.csv')
rows, columns = df.shape
print(f"Dataset Size: {rows} rows and {columns} columns")

Dataset Size: 607 rows and 12 columns


#### 1.2 - content:

In [6]:
print(df.head())

   Unnamed: 0  work_year experience_level employment_type  \
0           0       2020               MI              FT
1           1       2020               SE              FT
2           2       2020               SE              FT
3           3       2020               MI              FT
4           4       2020               SE              FT

                    job_title  salary salary_currency  salary_in_usd  \
0              Data Scientist   70000             EUR          79833
1  Machine Learning Scientist  260000             USD         260000
2           Big Data Engineer   85000             GBP         109024
3        Product Data Analyst   20000             USD          20000
4   Machine Learning Engineer  150000             USD         150000

  employee_residence  remote_ratio company_location company_size
0                 DE             0               DE            L
1                 JP             0               JP            S
2                 GB            50               GB            M
3                 HN             0               HN            S
4                 US            50               US            L

#### 1.3 - Format:

In [7]:
print(df.dtypes)

Unnamed: 0             int64
work_year              int64
experience_level      object
employment_type       object
job_title             object
salary                 int64
salary_currency       object
salary_in_usd          int64
employee_residence    object
remote_ratio           int64
company_location      object
company_size          object
dtype: object


#### 1.4 - URL: 
Our dataset source is Kaggle : https://www.kaggle.com/datasets/ruchi798/data-science-job-salaries?select=ds_salaries.csv

### 2 - Genral info about the Dataset

In [26]:
import pandas as pd
data_attributes = [
    {'Column': 'work_year', 'Description': 'The year the salary was paid.', 'Type': 'Interval'},
    {'Column': 'experience_level', 'Description': 'The experience level in the job during the year.', 'Type': 'Ordinal'},
    {'Column': 'employment_type', 'Description': 'The type of employment for the role.', 'Type': 'Nominal'},
    {'Column': 'job_title', 'Description': 'The role worked in during the year.', 'Type': 'Nominal'},
    {'Column': 'salary', 'Description': 'The total gross salary amount paid.', 'Type': 'Ratio'},
    {'Column': 'salary_currency', 'Description': 'The currency of the salary paid as an ISO 4217 code. ', 'Type': 'Nominal'},
    {'Column': 'salary_in_usd', 'Description': 'The salary in USD (adjusted by exchange rate).', 'Type': 'Ratio'},
    {'Column': 'employee_residence', 'Description': 'Employee\'s primary country of residence during the year.', 'Type': 'Nominal'},
    {'Column': 'remote_ratio', 'Description': 'The amount of work done remotely.', 'Type': 'Ordinal'},
    {'Column': 'company_location', 'Description': 'The country of the employer\'s main office.', 'Type': 'Nominal'},
    {'Column': 'company_size', 'Description': 'The average number of people working for the company.', 'Type': 'Ordinal'}
]
attributes_df = pd.DataFrame(data_attributes)
attributes_df

,Column,Description,Type
0,work_year,The year the salary was paid.,Interval
1,experience_level,The experience level in the job during the year.,Ordinal
2,employment_type,The type of employment for the role.,Nominal
3,job_title,The role worked in during the year.,Nominal
4,salary,The total gross salary amount paid.,Ratio
5,salary_currency,The currency of the salary paid as an ISO 4217...,Nominal
6,salary_in_usd,The salary in USD (adjusted by exchange rate).,Ratio
7,employee_residence,Employee's primary country of residence during...,Nominal
8,remote_ratio,The amount of work done remotely.,Ordinal
9,company_location,The country of the employer's main office.,Nominal
10,company_size,The average number of people working for the c...,Ordinal

#### 2.2 - shortcuts

In [28]:
import pandas as pd

abbreviation_data = [
    {'Column': 'experience_level', 'Shortcut': 'EN', 'Meaning': 'Entry-level / Junior'},
    {'Column': 'experience_level', 'Shortcut': 'MI', 'Meaning': 'Mid-level / Intermediate'},
    {'Column': 'experience_level', 'Shortcut': 'SE', 'Meaning': 'Senior-level / Expert'},
    {'Column': 'experience_level', 'Shortcut': 'EX', 'Meaning': 'Executive-level / Director'},
    
    {'Column': 'employment_type', 'Shortcut': 'PT', 'Meaning': 'Part-time'},
    {'Column': 'employment_type', 'Shortcut': 'FT', 'Meaning': 'Full-time'},
    {'Column': 'employment_type', 'Shortcut': 'CT', 'Meaning': 'Contract'},
    {'Column': 'employment_type', 'Shortcut': 'FL', 'Meaning': 'Freelance'},
    
    {'Column': 'salary_currency', 'Shortcut': 'USD', 'Meaning': 'United States Dollar'},
    {'Column': 'salary_currency', 'Shortcut': 'EUR', 'Meaning': 'Euro'},
    
    {'Column': 'employee_residence', 'Shortcut': 'US', 'Meaning': 'United States'},
    {'Column': 'employee_residence', 'Shortcut': 'DE', 'Meaning': 'Germany'},
    
    {'Column': 'company_location', 'Shortcut': 'US', 'Meaning': 'United States'},
    {'Column': 'company_location', 'Shortcut': 'DE', 'Meaning': 'Germany'},
    
    {'Column': 'company_size', 'Shortcut': 'S', 'Meaning': 'Small (<50 employees)'},
    {'Column': 'company_size', 'Shortcut': 'M', 'Meaning': 'Medium (50 to 250 employees)'},
    {'Column': 'company_size', 'Shortcut': 'L', 'Meaning': 'Large (>250 employees)'}
]

abbreviations_df = pd.DataFrame(abbreviation_data)
abbreviations_df

                Column Shortcut                       Meaning
0     experience_level       EN          Entry-level / Junior
1     experience_level       MI      Mid-level / Intermediate
2     experience_level       SE         Senior-level / Expert
3     experience_level       EX    Executive-level / Director
4      employment_type       PT                     Part-time
5      employment_type       FT                     Full-time
6      employment_type       CT                      Contract
7      employment_type       FL                     Freelance
8      salary_currency      USD          United States Dollar
9      salary_currency      EUR                          Euro
10  employee_residence       US                 United States
11  employee_residence       DE                       Germany
12    company_location       US                 United States
13    company_location       DE                       Germany
14        company_size        S         Small (<50 employees)
15        company_size        M  Medium (50 to 250 employees)
16        company_size        L        Large (>250 employees)